<script>
import { DatePicker } from "element-ui";
export default {
  /**
   * 在使用组件的时候还可以使用混入，不是直接在template中写标签，这样也可以展示这个ui组件中指定的组件
   * 原理是这样的
   * 在开发过程中，全局引入了ui库，我们经常使用ui组件的时候直接写的标签，再给这个标签设置一些属性，页面中就会给我们展示对应的组件样式
   * 还有一种用法就是使用混入，有时候某个ui组件会被很多页面用到，并且它的一些属性可能是变化的，如果我们每个页面都去写就台冗余了
   * 所以选择这种混入的方式，封装成一个公用的组件，在需要的地方直接引入即可，不用哪里需要就去哪里写一遍
   * 当我们导入DatePicker这个ui组件的时候，他实际上跟我们平时写的.vue文件作为一个组件，然后在另外一个组件中引入，然后在标签中使用时一样的
   * 我们导入的这个DatePicker就是一个.vue的组件，里面有标签，有属性，方法，只不过是人家给我们封装好了的
   * 所以我们可以手动写一个.vue的组件（这个组件啥也没有），然后采用混入的方式，将ui组件混入到我们这个手动写的组件里面，
   * 然后根据需要，像这个手动写的组件传入数据，去修改调混入的ui组件的相关属性，从而实现根据我们的需要展示对应的样式和功能
   * 
   * 还有一点，我们在导入某个组件的时候，我们在父组件中取的组件名代表的就是子组件的template中最外层的div，所以
   * <date-range-picker v-model="query.createTime" class="date-item" />代表的就是双向绑定 <el-date-picker></el-date-picker>
   * 这个ui组件，class也是给他设置的，这一点还是要明白的
   */
  mixins: [DatePicker],
  props: {
    // 这里面接收的参数对应的就是DatePicker组件的属性，从而修改属性，实现我们的需求
    type: {
      type: String,
      default: "daterange",
    },
  },
};
</script>